# Task 1

Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [133]:
# importing Libraries
import pandas as pd
import numpy as np

In [134]:

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
# show Dataframe
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [135]:
# Filling Nan Values with (previous_number+10)

df.loc[0, 'FlightNumber'] = df.loc[0, 'FlightNumber']
for i in range(1, len(df)):
    df.loc[i, 'FlightNumber'] = df.loc[i-1, 'FlightNumber']+10

In [136]:
# After Filling values
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [137]:
# Converting "FlightNumber" column into int type
df['FlightNumber'] = df['FlightNumber'].astype('Int64')

In [138]:
#After converting into int type 
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [139]:
df['FlightNumber'].dtype

Int64Dtype()

# Task 2

The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [140]:
# splitiing words from column "From_To" till where exists '_'

temp_df = df["From_To"].str.split("_", n = 1, expand = True)

In [141]:
# Setting a proper name to the columns
temp_df.columns=['Start','Destination']

In [142]:
#Show Temporary Dataframe
temp_df

      Start Destination
0    LoNDon       paris
1    MAdrid       miLAN
2    londON   StockhOlm
3  Budapest       PaRis
4  Brussels      londOn

# Task 3

Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [160]:
# Making thr first character of each word Capital

temp_df['Start'] = temp_df['Start'].str.capitalize() 
temp_df['Destination'] = temp_df['Destination'].str.capitalize()

In [144]:
temp_df

      Start Destination
0    London       Paris
1    Madrid       Milan
2    London   Stockholm
3  Budapest       Paris
4  Brussels      London

# Task 4
Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [145]:
#Dropping "From_To" columnn
df=df.drop('From_To',axis=1)

#Concating previous Dataframe with Temporary Datframe
df=pd.concat([df,temp_df],axis=1)

In [146]:
df

   FlightNumber  RecentDelays              Airline     Start Destination
0         10045      [23, 47]               KLM(!)    London       Paris
1         10055            []    <Air France> (12)    Madrid       Milan
2         10065  [24, 43, 87]  (British Airways. )    London   Stockholm
3         10075          [13]       12. Air France  Budapest       Paris
4         10085      [67, 32]          "Swiss Air"  Brussels      London

In [148]:
# Rearranging  "Start" and "Destination column" at first

columns=['Start', 'Destination','FlightNumber', 'RecentDelays', 'Airline']
df=df.reindex(columns=columns)

In [149]:
df

      Start Destination  FlightNumber  RecentDelays              Airline
0    London       Paris         10045      [23, 47]               KLM(!)
1    Madrid       Milan         10055            []    <Air France> (12)
2    London   Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest       Paris         10075          [13]       12. Air France
4  Brussels      London         10085      [67, 32]          "Swiss Air"

# Task 5 

In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

In [151]:
# Creating new Dataframe Where multiple values of  "Recenet Delays" will be in their own column 
# And rename their corresponding columns
new=pd.DataFrame(df.RecentDelays.values.tolist()).add_prefix('Delay_')

In [152]:
new

   Delay_0  Delay_1  Delay_2
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [153]:
#Concatiing Previous Dataframe with new dataframe where Delay value exists separately
df=pd.concat([df,new],axis=1)

In [154]:
df

,Start,Destination,FlightNumber,RecentDelays,Airline,Delay_0,Delay_1,Delay_2
0,London,Paris,10045,"[23, 47]",KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,[],<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,[13],12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"[67, 32]","""Swiss Air""",67.0,32.0,NaN